tap 'homebrew/cask-fonts'
tap 'dandavison/delta', 'https://github.com/dandavison/delta'
tap 'homebrew/command-not-found'

# core shell environment stuff
brew 'fish'
brew 'direnv'

# git
brew 'git-lfs'
brew 'git'

# general utilities
brew 'ack'
brew 'bash-completion'
brew 'bat'
brew 'coreutils'
brew 'exa'
brew 'fd'
brew 'findutils'
brew 'fzf'
brew 'jq'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'watch'
brew "mackup"
brew "mas"
brew "tree"
brew "pstree"

# networky
brew 'mtr'
brew 'nmap', args: ['with-pygtk']
brew 'rdesktop'
brew 'socat'
brew 'wget'

# ruby stuff
brew 'rbenv'
brew 'rbenv-ctags'
brew 'rbenv-default-gems'

# other languages' stuff
brew 'nodenv'
brew 'pyenv'
brew 'shellcheck'

# audio/video
brew 'ffmpeg'
brew 'youtube-dl'

# for https://github.com/drselump14/alfred-change-sound-output
brew 'switchaudio-osx'
brew 'terminal-notifier'

brew 'mas'

cask 'alfred' # there is an App store version, but you can't use powerpack with it
cask 'bartender'
cask 'dash'
cask 'discord'
cask 'fantastical'
cask 'google-chrome'
cask 'hammerspoon'
cask 'iterm2'
cask 'macbreakz'
cask 'macvim'
cask 'muzzle'
cask 'netspot'
cask 'omnigraffle'
cask 'rescuetime'
cask 'spotify'
cask 'viscosity'
cask "obsidian"
cask "signal"

# drivers
cask 'sonos'
cask 'steermouse' # for madcatz cyber rat driver, since the company went out of business, then came back without the downloads
cask 'xbox360-controller-driver-unofficial'

# fonts
cask 'font-fira-code'
cask 'font-firacode-nerd-font-mono'
cask 'font-firacode-nerd-font'
cask 'font-hack'
cask 'font-hammersmith-one'
cask 'font-inconsolata'
cask 'font-lobster'
cask 'font-press-start-2p'
cask 'font-quicksand'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-yellowtail'

mas "Slack", id: 803453959
mas "Microsoft Remote Desktop", id: 715768417
mas "LiquidText", id: 922765270
mas "Pixelmator", id: 407963104
mas "Mocha Keyboard", id: 953949626
mas "Irvue", id: 1039633667
mas "GoodNotes", id: 1444383602
mas "Evernote", id: 406056744
mas "Dice", id: 1479250666
