# frozen_string_literal: true
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/services'

tap 'homebrew/cask-fonts'
tap 'homebrew/command-not-found'
tap 'homebrew/cask-drivers'

# core shell environment stuff
brew 'fish'
brew 'direnv'
brew 'thefuck'

# git
brew 'git-lfs'
brew 'git'
brew 'git-delta'

# general utilities
brew 'less'
brew 'bat'
brew 'coreutils'
brew 'exa'
brew 'findutils'
brew 'fzf'
brew 'jq'
brew 'the_silver_searcher'
brew 'tree'
brew 'watch'
brew 'mackup'
brew 'mas'
brew 'tree'
brew 'pstree'

# networky
brew 'mtr'
brew 'nmap'
brew 'socat'
brew 'wget'

# programming languages
brew 'rbenv'
brew 'nodenv'
brew 'pyenv'
brew 'shellcheck'

brew 'mas'

cask 'aerial'
cask 'alfred' # there is an App store version, but you can't use powerpack with it
cask 'calibre'
cask 'bartender'
cask 'dash'
cask 'discord'
cask 'evernote'
cask 'fantastical'
cask 'google-chrome'
cask 'hammerspoon'
cask 'hookshot'
cask 'iterm2'
cask 'macbreakz'
cask 'macvim'
cask 'muzzle'
cask 'obsidian'
cask 'omnigraffle'
cask 'rescuetime'
cask 'signal'
cask 'slack'
cask 'sony-ps4-remote-play'
cask 'spotify'
cask 'viscosity'
cask 'visual-studio-code'

# drivers
cask 'steermouse'

# fonts
cask 'font-fira-code'
cask 'font-hack'
cask 'font-hammersmith-one'
cask 'font-inconsolata'
cask 'font-lobster'
cask 'font-press-start-2p'
cask 'font-quicksand'
cask 'font-source-code-pro'

mas 'GoodNotes', id: 1_444_383_602
mas 'LiquidText', id: 922_765_270
mas 'Pixelmator', id: 407_963_104
