tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'neovim/neovim'
tap 'nodenv/nodenv'

brew 'ack'
brew 'bash-completion'
brew 'coreutils'
brew 'crystal-lang'
brew 'ctags'
brew 'elixir'
brew 'ffmpeg'
brew 'findutils'
brew 'fish'
brew 'fzf'
brew 'git'
brew 'git-lfs'
brew 'jq'
brew 'macvim', args: ['with-lua', 'with-luajit', 'with-csope', 'with-python3', 'without-python']
brew 'mas'
brew 'mr'
brew 'mtr'
brew 'ncdu'
brew 'neovim'
brew 'nmap', args: ['with-pygtk']
brew 'nodenv'
brew 'rbenv'
brew 'rbenv-ctags'
brew 'rbenv-default-gems'
brew 'rdesktop'
brew 's3cmd'
brew 'shellcheck'
brew 'socat'
brew 'switchaudio-osx'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'youtube-dl'

# brew 'nodenv-package-json-engine'

cask 'adobe-creative-cloud'
cask 'adobe-creative-cloud-cleaner-tool'
cask 'adobe-photoshop-cc'
cask 'airfoil'
cask 'alfred' # there is an App store version, but you can't use powerpack with it
cask 'android-studio'
cask 'atom'
cask 'box-sync'
cask 'ccleaner'
cask 'cleanmymac'
cask 'dash'
cask 'dayone-cli'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'encryptme'
cask 'etrecheck'
cask 'fantastical'
cask 'flux'
cask 'gitter'
cask 'google-chrome'
cask 'hammerspoon'
cask 'iterm2'
cask 'lastfm'
cask 'macbreakz'
cask 'malwarebytes'
cask 'minikube'
cask 'muzzle'
cask 'netspot'
cask 'nicecast'
cask 'notion'
cask 'omnifocus'
cask 'omnigraffle'
cask 'rescuetime'
cask 'scansnap-manager-ix500'
cask 'skype'
cask 'sonos'
cask 'spotify'
cask 'steam'
cask 'teamviewer'
cask 'vagrant'
cask 'virtualbox'
cask 'viscosity'
cask 'vlc'
cask 'wireshark'
cask 'xquartz'

cask 'font-fira-code'
cask 'font-firacode-nerd-font'
cask 'font-firacode-nerd-font-mono'
cask 'font-hack'
cask 'font-hammersmith-one'
cask 'font-inconsolata'
cask 'font-quicksand'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-yellowtail'

mas '1Password', id: 443987910
mas 'CloudApp', id: 417602904
mas 'Day One', id: 1055511498
mas 'Microsoft Remote Desktop', id: 715768417
mas 'MindNode', id: 1289197285
mas 'Pixelmator', id: 407963104
mas 'Transmit', id: 403388562
mas 'Twitter', id: 409789998
mas 'GIPHY CAPTURE', id: 668208984
