tap 'caskroom/cask'
tap 'caskroom/fonts'

brew 'ack'
brew 'bash-completion'
brew 'coreutils'
brew 'ctags'
brew 'gifsicle'
brew 'git'
brew 'git-lfs'
brew 'jq'
brew 'mr'
brew 'mtr'
brew 'ncdu'
brew 'rbenv'
brew 's3cmd'
brew 'shellcheck'
brew 'the_silver_searcher'
brew 'tree'

cask 'airfoil'
cask 'alfred' # there is an App store version, but you can't use powerpack with it
cask 'atom'
cask 'cloak'
cask 'dropbox'
cask 'flux'
cask 'gitter'
cask 'google-chrome'
cask 'macbreakz'
cask 'macvim'
cask 'nicecast'
cask 'omnifocus'
cask 'omnigraffle'
cask 'opendns-updater'
cask 'rdio'
cask 'screenhero'
cask 'skype'
cask 'soundflower'
cask 'steam'
cask 'wireshark'
cask 'xquartz'

cask 'font-source-code-pro'
