tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'neovim/neovim'
tap 'nodenv/nodenv'

brew 'ack'
brew 'bash-completion'
brew 'coreutils'
brew 'ctags'
brew 'findutils'
brew 'fzf'
brew 'gifsicle'
brew 'git'
brew 'git-lfs'
brew 'jq'
brew 'mr'
brew 'mtr'
brew 'ncdu'
brew 'neovim'
brew 'nmap', args: ['with-pygtk']
brew 'rbenv'
brew 'rbenv-ctags'
brew 'rbenv-default-gems'
brew 's3cmd'
brew 'shellcheck'
brew 'switchaudio-osx'
brew 'the_silver_searcher'
brew 'tree'
brew 'wget'
brew 'youtube-dl'

brew 'nodenv-package-json-engine'

cask 'adobe-creative-cloud'
cask 'adobe-creative-cloud-cleaner-tool'
cask 'adobe-photoshop-cc'
cask 'airfoil'
cask 'alfred' # there is an App store version, but you can't use powerpack with it
cask 'atom'
cask 'cloak'
cask 'dash'
cask 'dayone-cli'
cask 'docker'
cask 'dropbox'
cask 'flux'
cask 'gitter'
cask 'google-chrome'
cask 'lastfm'
cask 'macbreakz'
cask 'macvim'
cask 'nicecast'
cask 'omnifocus'
cask 'omnigraffle'
cask 'opendns-updater'
cask 'rdio'
cask 'rescuetime'
cask 'screenhero'
cask 'skype'
cask 'soundflower'
cask 'spotify'
cask 'steam'
cask 'vagrant'
cask 'virtualbox'
cask 'viscosity'
cask 'wireshark'
cask 'xquartz'

cask 'font-hack'
cask 'font-inconsolata'
cask 'font-source-code-pro'

cask 'font-fira-code'
cask 'font-firacode-nerd-font'
cask 'font-firacode-nerd-font-mono'
