jorgebucaran/fisher
jorgebucaran/nvm.fish
halostatue/fish-direnv
jethrokuan/z
jorgebucaran/autopair.fish
gazorby/fish-abbreviation-tips
danhper/fish-ssh-agent
patrickf1/fzf.fish
wawa19933/starship.fish
